app/Models/BukuModel.php

SELECT *
FROM `buku`
 LIMIT 10
---
    public function getAllDataBuku(){

        $queryResult = $this->findAll(10);

SELECT `dipinjam`
FROM `buku`
WHERE `id_buku` = 'lOO0rV4uvXv5KKP'
SELECT `stok`
FROM `buku`
WHERE `id_buku` = 'lOO0rV4uvXv5KKP'
UPDATE `buku` SET `dipinjam` = 5
WHERE `id_buku` = 'lOO0rV4uvXv5KKP'
UPDATE `buku` SET `stok` = 25
WHERE `id_buku` = 'lOO0rV4uvXv5KKP'
---
    public function updateIncrementDataDiPinjamFieldByIdBuku(string $idBuku): void
    {
        try {
            // mencari data buku
            $queryResultDipinjam    = $this->select('dipinjam')->where('id_buku',$idBuku)->find();
            $queryResultStok        = $this->select('stok')->where('id_buku',$idBuku)->find();

            // increment dipinjam dan mengubah stok(decrement)
            $dipinjamValue = $queryResultDipinjam[0]->dipinjam;
            $stokValue     = $queryResultStok[0]->stok;

            // update nilai dipinjam
            $this->set('dipinjam',$dipinjamValue+1)
                ->where('id_buku',$idBuku)
                ->update();

            $this->set('stok',$stokValue-1)
                ->where('id_buku',$idBuku)
                ->update();

SELECT `dibooking`
FROM `buku`
WHERE `id_buku` = 'lOO0rV4uvXv5KKP'
UPDATE `buku` SET `dibooking` = 0
WHERE `id_buku` = 'lOO0rV4uvXv5KKP'
---
    public function updateDecrementDataDiBookingFieldByIdBuku(string $idBuku): void
    {
        try {
            // mencari data buku
            $queryResult    = $this->select('dibooking')->where('id_buku',$idBuku)->find();
            $dibookingValue = $queryResult[0]->dibooking;

            // update nilai dibooking
            $this->set('dibooking',$dibookingValue-1)
                ->where('id_buku',$idBuku)
                ->update();