app/Models/BukuModel.php

    public function findAllBukuByJudulBuku(string $judulBuku): array|object
    {
        // mendapatkan data dari database, Note : ini menghasilkan Array object
        $result = $this->asArray()->where("judul_buku", $judulBuku)->find();
---
SELECT *
FROM `buku`
WHERE `judul_buku` = 'pendongeng handal'