app/Models/DetailPinjamModel.php

INSERT INTO `detail_pinjam` (`no_pinjam`, `id_buku`, `denda`) VALUES ('N5hV10ektLgwCmn', 'lOO0rV4uvXv5KKP', 9000)
---
    public function insertData(DetailPinjamEntity $detailPinjamEntity): void
    {
        try {
            // menambahkan data
            $resultQuery    = $this->insert($detailPinjamEntity);