app/Models/PinjamModel.php

INSERT INTO `pinjam` (`no_pinjam`, `tgl_pinjam`, `id_booking`, `id_user`, `tgl_kembali`, `tgl_pengembalian`, `status`, `total_denda`) VALUES ('N5hV10ektLgwCmn', '2023-11-02', '4znofG4YnfVKGvA', ' 31mOVLpsC2z9mCS', '2023-11-12', NULL, 'dipinjam', 0)
---
    public function insertData(PinjamEntity $pinjamEntity): void
    {
        try {
            // menambahkan data
            $resultQuery    = $this->insert($pinjamEntity);

SELECT *
FROM `pinjam`
WHERE `id_booking` = '4znofG4YnfVKGvA'
---
    public function getDataPinjamByIdBooking(string $idBooking){
        $resultQuery    = $this->where('id_booking',$idBooking)
                                ->find();