app/Models/UserModel.php

    public function insertData(UserEntity $userEntity): void
    {
        try {

            // menambahkan data, dan menyimpan hasil dari aksi query insert
            $resultQuery = $this->insert($userEntity);
---
INSERT INTO `user` (`id_user`, `role_user`, `nama`, `alamat`, `email`, `gambar`, `password`, `is_active`, `tanggal_input`) VALUES ('iF44Ngay6TA2dxY', 'anggota', 'haslamku', 'haslamku jalana', 'isempa31@gmail.com', '/tmp/phpyWF5Sz', 'haslam', 'active', '2023-10-11 07:16:19')